[
    {
      "pname": "Amkette Wi-Key Backlit Wired Keyboard",
      "pdetails": "White Backlit with Brightness Control | Laser-Etched Keys | 12 Multi-Media Keys | Plug and Play USB Connection | Compatible with PC/Mac/Laptop | 1 Year Warranty",
      "plink": "",
      "pricerange": "700 - 800",
      "additional_details": ["Introducing our Full-Size Wired Keyboard with White Backlight, designed to enhance your typing experience in low-light conditions. This keyboard offers the convenience of easily switching off the backlight and provides three brightness levels for personalized illumination.", 
      "Equipped with 12 multimedia shortcut keys, the Wi-Key Backlit Keyboard puts control at your fingertips, making it effortless to manage your multimedia tasks.", 
      "Featuring a generous 1.4-meter cable with a granular texture, our keyboard ensures reliable connectivity and durability.",
    "Featuring a generous 1.4-meter cable with a granular texture, our keyboard ensures reliable connectivity and durability.",
    "Enjoy universal compatibility with this keyboard, as it seamlessly works with various operating systems including Microsoft Windows, macOS, and Linux.",
    "Hassle-Free 1-Year Manufacturing Warranty | Please Call or WhatsApp our customer support in case of any issues."]
      
    },
    {
      "pname": "Dyazo Metal Gaming Keyboard & Mouse Combo",
      "pdetails": "Combo with Breathable Lights 3 Light Modes | 12 Multimedia Keys | Braided Cable 1.5 Metres (Silver)",
      "plink": "",
      "pricerange": "900 - 1100",
      "additional_details": [
        "104 Keys (12 Multimedia Keys)",
        "Windows Launch Key",
        "3 Light Modes (On | Off | Breathe)",
        "Breathe Use Fn + Scroll Button For This Function",
        "Keyboard Dimensions 475 * 190 * 41 mm (640 grams)",
        "Mouse Dimension 125 * 79 * 35 mm (110 grams)",
        "Cable Is Braided 1.5 Metre Length",
        "Lifespan Of Keyboard And Mouse Is > 5 Million Times",
        "Dyazo Metal Keyboards Comes With Metal Alloy Body & Plastic Pads Are Included On The Bottom Backside To Prevent Sliding While You Using In Using",
        "This Plug-And-Play Gaming Keyboard And Mouse (No Additional Software Needed) Connects Through Modern USB Interface, And Is Compatible With All Modern Operative Systems"
      ]
      
    },
    
    {
      "pname": "Ant Esports KM1610 LED Keyboard",
      "pdetails": "Keyboard and Mouse Combo, 104 Keys Rainbow Backlit Keyboard and 7 Colour RGB Mouse, White Gaming Keyboard and Mouse Combo for PC Laptop Xbox PS4 Gamers and Work",
      "plink": "",
      "pricerange": "600 - 800",
      "additional_details": [
        "Rainbow LED Gaming Keyboard: The rainbow LED keyboard, with rainbow backlighting and white keycaps has a highly-translucent effect, bringing you the ultimate gaming atmosphere. With a choice of static/breathing mode lights, you can also adjust the backlight brightness and breathing speed, or turn off the backlight when you don't need it. Great for gaming or work",
        "High Performance Wired Keyboard: 12 multimedia keys for gaming or work efficiency. Interchangeable WASD keys and WIN lock function improves your gaming performance. With 19 anti-collision keys, no tap will be lost, ensuring smooth typing",
        "Ergonomic Keyboard: The light-up keyboard has an ergonomic design. Curved keycaps, stepped layout, collapsible feet, and crater keys. Gives you a comfortable typing experience and improves the accuracy of keystrokes. This white wired keyboard is ideal for gaming and office work",
        "Wired Gaming Mouse: The USB wired gaming mouse features a high-precision sensor and low-friction PTFE feet to give you precise and smooth control. Easily switch among four DPI (dots per inch) levels (1200 DPI/1800 DPI/2400 DPI/3600 DPI). 6 buttons (2 side buttons). Long press the DPI button to switch between 7-color breathing and red light modes",
        "Strong Compatibility: The gaming mouse and keyboard combo is suitable for PC, laptop, PS3, PS4, PS5, Xbox, and Mac. USB plug and play, no additional drivers required. Compatible with Windows 2000/2003/XP/Vista/Win7/Win8/Win10/Win11"
      ]
    },
    {
      "pname": "Amazon Basics Wireless Bluetooth Keyboard",
      "pdetails": "Bluetooth Multi-Device Keyboard for Windows, Apple iOS Android Or Chrome, Compact Space-Saving Design, for Pc/Mac/Laptop/Smartphone/Tablet (Black)",
      "plink": "",
      "pricerange": "1100 - 1300",
      "additional_details": [
        "Wireless Multi-Device Keyboard with enhanced efficiency",
        "Extremely durable and spill-resistant surviving any minor accidents",
        "Versatile feature that allows you to connect with any Bluetooth-enabled device with external keyboard support",
        "Integrated cradle to hold your phone while you type",
        "Easy-Switch Dial for absolute convenience",
        "Compatible with most PCs, smartphones, iPhones, Tablets, etc."
      ]
    },
    
    {
      "pname": "Zebronics Jet Premium",
      "pdetails": "Wired Gaming On Ear Headphone with LED Light for earcups, 40mm Neodymium Drivers, 2 Meter Braided Cable, Flexible mic, Suspension Headband, 3.5mm + USB Connector (Black + Blue)",
      "plink": "",
      "pricerange": "700 - 900",
      "additional_details": [
        "Get immersed into your gaming world with the 40mm Neodymium drivers which produce the best sound signature for a Gaming headphone! Powerful Bass, minor details like footsteps and gunshots, Clear vocals are easily audible with ZEB-JET!",
        "ZEB-JET Gaming headphones are made Gaming-grade with the 2 meter Braided cable for the rigid and rugged long time usage purpose.",
        "Elevate your gaming experience with the LED light arrangement on the earcups! The lights are multicolor, reflecting a varied range of color combinations.",
        "With the Plug and play usage, users simply need to plug in the 3.5mm AUX jack for both speaker output and microphone input. The additional USB connector is for LED lights.",
        "The headphones provide options for adjusting the mic position as it is flexible and Mute / Unmute the mic when required, with the In-line controller pod.",
        "Simply wear the headphones, as the suspension headbands automatically adjust according to the user's comfort. No manual adjustment for the headband is required.",
        "The In-line controller helps to control the volume level and the mic On/Off button.",
        "Lightweight design, comfortable and soft ear cushions and suspension headbands for long hours of gaming."
      ]
    },
    {
      "pname": "Matlek Gaming Over Ear Headphones",
      "pdetails": "Gaming Over Ear Headphones with Adjustable Mic | Works with All The Mobile Phones | Surround Sound, Deep Bass, Blue",
      "plink": "",
      "pricerange": "500 - 700",
      "additional_details": [
        "3D GAMING SOUND: It’s important for you to hear footsteps & distant gunshots from different directions. This headset offers a 360-degree soundscape to provide realism to your gaming session.",
        "FLEXIBLE NOISE CANCELLATION BOOM MIC: Matlek headset accurately picks up your voice to cancel out other background noises.",
        "ERGONOMIC SOFT EARMUFF+ADJUSTABLE HEADBAND+LIGHTWEIGHT: This Headphone is shaped to naturally fit the human head, the earmuff is filled with soft memory foam, and adjustable headband.",
        "MULTI-PLATFORM COMPATIBILITY: Use 3.5MM JACK TO CONNECT with Mobile Phones, Tablets, PS4, Xbox One.",
        "RELIABLE AFTER-SALE SUPPORT: Your using experience is what we mostly cherish. We will make our greatest effort to take responsibility for your shopping experience.",
        "Model: Gh-16 Blue",
        "Control Type: Volume Control"
      ]
    },
    
    {
      "pname": "Carbon Wired USB Gaming Over Ear Headphones",
      "pdetails": "TAG Carbon Wired USB Gaming Over Ear Headphones, Headset with Mic & RGB Effect",
      "plink": "",
      "pricerange": "1300 - 1500",
      "additional_details": [
        "Sound Quality: Truly immerse yourself in your games with high-quality audio that lets you hear every single footstep in-game.",
        "Microphone: TAG Carbon comes equipped with a high-quality built-in noise-canceling microphone for quick and stable communication.",
        "Build Quality: Its luxurious noise-isolating memory foam ear pads and adjustable split headband reduce pressure and provide optimal comfort for long gaming sessions.",
        "Noise Cancellation: TAG Carbon provides you a passive noise-canceling experience. Its closed ear cups design blocks any kind of distraction from outside which helps you keep focus during the game for as long as you want.",
        "Warranty: 1 year warranty",
        "Control Type: Call Control",
        "Model: Tag Gamerz Carbon"
      ]
    },
    {
      "pname": "STRIFF Mpad Mouse Mat",
      "pdetails": "Mouse Mat 230X190X3mm Gaming Mouse Pad, Non-Slip Rubber Base, Waterproof Surface, Premium-Textured, Compatible with Laser and Optical Mice(Universe Black)",
      "plink": "",
      "pricerange": "90 - 110",
      "additional_details": ["9.4 Inches X 7.9 Inches) 240mm x 200mm x 2mm Size: This mouse pad is ideal for Gamers, Graphic Designers, Students, or anyone using mouse for long sessions. This helps to improve the gaming experience for gamers or the work efficiency in the office."]
    },
    
    {
      "pname": "Tizum Mouse Pad",
      "pdetails": "Mouse Pad/Computer Mouse Mat with Anti-Slip Rubber Base | Smooth Mouse Control | Spill-Resistant Surface for Laptop, Notebook, MacBook, Gaming, Laser/Optical Mouse, 9.4”x 7.9”, Multicolored",
      "plink": "",
      "pricerange": "100 - 130",
      "additional_details": [
        "Size: 9.4 Inches X 7.9 Inches (240mm x 200mm x 2mm)",
        "Ideal for Gamers, Graphic Designers, Students, or anyone using a mouse for long sessions. This helps to improve the gaming experience for gamers or the work efficiency in the office.",
        "Durable Manufacturing Design with Enhanced Precision: High-density premium texture which was processed in a high-temperature and high-pressure chamber to ensure long-term use without deformation and degumming.",
        "Ultra-smooth Lycra Cover: Our mouse pad adopts high-quality Lycra cloth on the cover for smooth gliding. It was optimized for fast movement while maintaining excellent accuracy and control. It is compatible with mechanical and optical mice.",
        "Works with Laser, Optical Mouse, Bluetooth Mouse.",
        "Non-slip Rubber Base: The soft and dense non-skid nature rubber base keeps the pad firmly in place. It provides stable operation of the mouse. Just immerse into your work or games without worrying about the annoying mouse pad movement."
      ]
    },
    {
      "pname": "Tukzer Large Size Gaming Mouse Pad",
      "pdetails": "(795mm x 298mm x 3.45mm) Extended Gaming Mouse Pad| Stitched Embroidery Edges| Non-Slip Rubber Base |for Computer Laptop | Keyboard Mouse Pad for Office & Home (Matrix)",
      "plink": "",
      "pricerange": "400 - 600",
      "additional_details": [
        "OPTIMUM SIZE 31.1 x 11.8 INCH: This XXL size extended mouse pad is large enough to fit your gaming mouse, full-size mechanical keyboard, and other desk items. Keep a clean, uncluttered desk. Play with the freedom to configure your setup anyway you want. This is a perfect gaming mouse pad for those who use a lower DPI or just like to have more room to maneuver.",
        "HIGLY DURABLE DESIGN: Frayed edges and low-quality materials are problems many gamers are familiar with. The Tukzer gaming mouse pad made of advanced ultra-smooth microfiber cloth textile chosen only after countless hours of testing. Neatly stitched edges prevent wrapping and frying which increasing durability. You can fold & roll this mouse pad without fold marks. So you can carry anywhere or store safely when Not in Use.",
        "SUPERIOR MOUSE CONTROL SURFACE: High-density textile structure optimized for fast moving while maintaining excellent balance between glide and control. The performance-tuned surface optimizes mouse tracking accuracy for both optical and laser sensors.",
        "NON-SLIP RUBBER BASE: The soft and dense non-skid nature rubber base keeps this desk pad firmly in place. This large mouse mat remains uniformly flat even over imperfect surfaces. Just immerse into your work or games without worrying about the annoying mouse pad movement.",
        "EASY TO FOLD & CARRY: You can fold & roll this mouse pad without fold marks, so you can carry it anywhere or store it safely when not in use."
      ]
    },
    
    {
      "pname": "Tukzer Large Size Gaming Mouse Pad",
      "pdetails": "(795mm x 298mm x 3.45mm) Extended Gaming Mouse Pad| Stitched Embroidery Edges| Non-Slip Rubber Base |for Computer Laptop | Keyboard Mouse Pad for Office & Home (Color Waves)",
      "plink": "",
      "pricerange": "400 - 600",
      "additional_details":  [
        "OPTIMUM SIZE: 31.1 x 11.8 INCH",
        "This XXL size extended mouse pad is large enough to fit your gaming mouse, full-size mechanical keyboard, and other desk items. Keep a clean, uncluttered desk. Play with the freedom to configure your setup any way you want. This is a perfect gaming mouse pad for those who use a lower DPI or just like to have more room to maneuver.",
        "HIGHLY DURABLE DESIGN",
        "Frayed edges and low-quality materials are problems many gamers are familiar with. The Tukzer gaming mouse pad is made of advanced ultra-smooth microfiber cloth textile chosen only after countless hours of testing. Neatly stitched edges prevent wrapping and fraying, increasing durability. You can fold & roll this mouse pad without fold marks, so you can carry it anywhere or store it safely when not in use.",
        "SUPERIOR MOUSE CONTROL SURFACE",
        "High-density textile structure optimized for fast moving while maintaining excellent balance between glide and control. The performance-tuned surface optimizes mouse tracking accuracy for both optical and laser sensors.",
        "NON-SLIP RUBBER BASE",
        "The soft and dense non-skid nature rubber base keeps this desk pad firmly in place. This large mouse mat remains uniformly flat even over imperfect surfaces. Just immerse into your work or games without worrying about the annoying mouse pad movement.",
        "EASY TO FOLD & CARRY",
        "You can fold & roll this mouse pad without fold marks, so you can carry it anywhere or store it safely when not in use."
      ]
    },
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    },
    {
      "pname": "",
      "pdetails": "",
      "plink": "",
      "pricerange": "",
      "additional_details": ["", "", "..."]
    }
    
]
  